Диплом_2_часть/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОписаниеПроблемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ВыполненныеРаботы</name>
    <attributes>
      <name>ВКМ_ОписаниеРабот</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ПотраченаЧасовФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Диплом_2_часть/src/AccumulationRegisters/ВКМ_ВыполненныеКлиентуРаботы/ВКМ_ВыполненныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеКлиентуРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом_2_часть/src/AccumulationRegisters/ВКМ_ВыполненныеСотрудникомРаботы/ВКМ_ВыполненныеСотрудникомРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполненныеСотрудникомРаботы</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Диплом_2_часть/src/InformationRegisters/ВКМ_УсловияОплатыСотрудников/ВКМ_УсловияОплатыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_УсловияОплатыСотрудников</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>Оклад</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентПремии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Диплом_2_часть/src/InformationRegisters/ВКМ_АбонентскаяПлата/ВКМ_АбонентскаяПлата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВКМ_АбонентскаяПлата</name>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Диплом_2_часть/src/Documents/ВКМ_ОбслуживаниеКлиента/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
		
	Если НужноОтправитьУведомление() Тогда
		СоздатьУведомлениеТелеграм()
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	//проверка установленного процента премии
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентПремии КАК ПроцентПремии,
	|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	|ИЗ
	|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Период, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	Запрос.УстановитьПараметр("Сотрудник", ВКМ_Специалист);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ПроцентОтРабот = ВыборкаДетальныеЗаписи.ПроцентПремии;
	Иначе
		ШаблонТекста = "Специалисту %1 не установлен процент оплаты от работ.";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(ШаблонТекста,ВыборкаДетальныеЗаписи.Сотрудник);
		Сообщение.Сообщить();
		Отказ = Истина; 
	КонецЕсли;
	
	// Получаем стоимость часа из РС Абонен.плата только по ДП с Абонен.обслуживание
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_АбонентскаяПлатаСрезПоследних.СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	|	ВКМ_АбонентскаяПлатаСрезПоследних.ДоговорКонтрагента.Представление КАК ДоговорКонтрагентаП
	|ИЗ
	|	РегистрСведений.ВКМ_АбонентскаяПлата.СрезПоследних(&Период, ДоговорКонтрагента = &Договор) КАК
	|		ВКМ_АбонентскаяПлатаСрезПоследних";
	
	Запрос.УстановитьПараметр("Период",ТекущаяДата());
	Запрос.УстановитьПараметр("Договор",ВКМ_Договор);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		СтоимостьЧасаРабот = ВыборкаДетальныеЗаписи.СтоимостьЧасаРаботы;
	Иначе 
		СтоимостьЧасаРабот = 0;
		ШаблонТекста = "По договору: %1 не установлена стоимость часа работы. Документ не может быть проведен";
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон(ШаблонТекста,ВыборкаДетальныеЗаписи.ДоговорКонтрагентаП);
		Сообщение.Сообщить();
		Отказ = Истина; 
	КонецЕсли;

	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Для Каждого ТекСтрокаВКМ_ВыполненныеРаботы из ВКМ_ВыполненныеРаботы Цикл
		ДвижениеКлиент = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		ДвижениеКлиент.Период = Дата;
		ДвижениеКлиент.Клиент = ВКМ_Клиент;
		ДвижениеКлиент.Договор = ВКМ_Договор;
		ДвижениеКлиент.КоличествоЧасов = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплате;
		ДвижениеКлиент.СуммаКОплате = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплате* СтоимостьЧасаРабот;
		
		//регистр ВКМ_ВыполненныеСотрудникомРаботы
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		ДвижениеСпециалист = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
		ДвижениеСпециалист.Период = Дата;
		ДвижениеСпециалист.Сотрудник = ВКМ_Специалист;
		ДвижениеСпециалист.КоличествоЧасов = ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплате;
		ДвижениеСпециалист.СуммаКОплате = Число(ТекСтрокаВКМ_ВыполненныеРаботы.ВКМ_ЧасыКОплате) * Число(СтоимостьЧасаРабот)* Число(ПроцентОтРабот)/ 100;
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НужноОтправитьУведомление()
	
	Если ЭтоНовый() Тогда// Если это новый документ - уведомляем
		Возврат Истина;		
	КонецЕсли;
	
	Попытка
	ПредыдущийДокумент = Ссылка.ПолучитьОбъект();// сохр. версия
    Исключение
        Возврат Истина;//если ссылки нет, надо уведомить
    КонецПопытки;
    
    Если ПредыдущийДокумент = Неопределено Тогда
        Возврат Истина;
    КонецЕсли;
	//при изменении дат или специалиста
	Если ВКМ_Специалист <> ПредыдущийДокумент.ВКМ_Специалист Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ВКМ_ДатаПроведенияРабот <> ПредыдущийДокумент.ВКМ_ДатаПроведенияРабот Тогда
	Возврат Истина;	
	КонецЕсли;
	
	Если ВКМ_ВремяНачалаРаботПлан <> ПредыдущийДокумент.ВКМ_ВремяНачалаРаботПлан  Тогда
	Возврат Истина;		
	КонецЕсли;
	
	Если ВКМ_ВремяОкончанияРаботПлан <> ПредыдущийДокумент.ВКМ_ВремяОкончанияРаботПлан Тогда
	Возврат Истина;		
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции	

Процедура СоздатьУведомлениеТелеграм()
	
	ТекстСообщения = СформироватьТекстУведомления();
	Если НЕ ЗначениеЗаполнено(ТекстСообщения) Тогда
		Возврат
	КонецЕсли;	
	НовыйОбъектУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
	НовыйОбъектУведомление.ВКМ_ТекстСообщения = ТекстСообщения;
	НовыйОбъектУведомление.Записать();

КонецПроцедуры	

Функция СформироватьТекстУведомления()
	
	Если ЭтоНовый() Тогда
		ШаблонТекста = "Новая заявка %1 %2. Клиент %3, дата проведения работ %4, начало работ %5, планируемое окончание работ %6, специалист %7 ";
		ТекстСообщения = СтрШаблон(ШаблонТекста, Номер, Дата, ВКМ_Клиент, ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРаботПлан, ВКМ_ВремяОкончанияРаботПлан, ВКМ_Специалист);
		Возврат ТекстСообщения;
	КонецЕсли;	
	
	ПредыдущийДокумент = Ссылка.ПолучитьОбъект();
		
	Если ПредыдущийДокумент <> Неопределено Тогда
		
		Если ВКМ_Специалист <> ПредыдущийДокумент.ВКМ_Специалист Тогда	
		ШаблонТекста = "В заявке %1 %2. Клиент %3, дата проведения работ %4, начало работ %5, планируемое окончание работ %6, ИЗМЕНИЛСЯ специалист %7";
		ТекстСообщения = СтрШаблон(ШаблонТекста, Номер, Дата, ВКМ_Клиент, ВКМ_ДатаПроведенияРабот, ВКМ_ВремяНачалаРаботПлан,
		ВКМ_ВремяОкончанияРаботПлан, ВКМ_Специалист);
		КонецЕсли;
		
		Если ВКМ_ДатаПроведенияРабот <> ПредыдущийДокумент.ВКМ_ДатаПроведенияРабот Тогда
		ШаблонТекста = "В заявке %1 %2. Клиент %3, ИЗМЕНИЛАСЬ дата проведения работ %4, начало работ %5, планируемое окончание работ %6, специалист %7";	
		ТекстСообщения = СтрШаблон(ШаблонТекста, Номер, Дата, ВКМ_Клиент, ВКМ_ДатаПроведенияРабот,
		ВКМ_ВремяНачалаРаботПлан, ВКМ_ВремяОкончанияРаботПлан, ВКМ_Специалист);
		КонецЕсли;
		
		Если ВКМ_ВремяНачалаРаботПлан <> ПредыдущийДокумент.ВКМ_ВремяНачалаРаботПлан Тогда
		ШаблонТекста = "В заявке %1 %2. Клиент %3, дата проведения работ %4,  ИЗМЕНИЛОСЬ ВРЕМЯ начала работ %5, планируемое окончание работ %6, специалист %7";	
		ТекстСообщения = СтрШаблон(ШаблонТекста, Номер, Дата, ВКМ_Клиент, ВКМ_ДатаПроведенияРабот,
		ВКМ_ВремяНачалаРаботПлан, ВКМ_ВремяОкончанияРаботПлан, ВКМ_Специалист);
		КонецЕсли;
		
		Если ВКМ_ВремяОкончанияРаботПлан <> ПредыдущийДокумент.ВКМ_ВремяОкончанияРаботПлан Тогда
		ШаблонТекста = "В заявке %1 %2. Клиент %3, дата проведения работ %4, начало работ %5, ИЗМЕНИЛОСЬ ПЛАНИРУЕМОЕ ВРЕМЯ окончание работ %6, специалист %7";	
		ТекстСообщения = СтрШаблон(ШаблонТекста, Номер, Дата, ВКМ_Клиент, ВКМ_ДатаПроведенияРабот,ВКМ_ВремяНачалаРаботПлан, ВКМ_ВремяОкончанияРаботПлан, ВКМ_Специалист);
		КонецЕсли;
	КонецЕсли;
	Возврат ТекстСообщения;
КонецФункции
#КонецОбласти
#КонецЕсли
